#ifndef	__TIMER_H
#define	__TIMER_H

#include "stm32f10x.h"

//------------------------------------------------------------------------------------------------
// TIMx_IT_Update_time = (TIMx_Reload_Num + 1) * ( TIMx_Frequency_Divide + 1 ) / TIMx_input_CLK
//   TIMx溢出时间   		 		重装载值						分频系数				 TIMx的输入时钟
//------------------------------------------------------------------------------------------------

// 1ms中断一次（全局时基）
//--------------------------------
// 分频系数：72（分频值+1）
// 计数频率：1MHz
// 计数周期：1us
// 重装载值：999
// 溢出周期：1ms
// 溢出频率：1kHz
//-----------------------------------------------------------------------------------------------
#define	TIM3_Frequency_Divide	71		// TIM3时钟预分频值
#define	TIM3_Reload_Num			999		// 自动重装载寄存器的值
//-----------------------------------------------------------------------------------------------


void TIM3_Time_Init(void) ;


#endif	/* __TIMER_H */
